export class MailFakeDb
{
    public static mails = [
        {
            'id'            : '15459251a6d6b397565',
            'from'          : {
                'name'  : 'مدير الشكاوى',
                'avatar': 'assets/images/avatars/carl.jpg',
                'email' : ''
            },
            'to'            : [
                {
                    'name' : 'me',
                    'email': 'johndoe@creapond.com'
                }
            ],
            'subject'       : 'تأخر طلب تقديم العضوية',
            'message'       : `<p>بـ جُل هناك وإعلان وفرنسا, يبق بـ الدمج التكاليف. السادس السيطرة غير أن. دار بـ أحدث يعادل أوروبا, الشهيرة الإمتعاض الأمريكية إذ حدى, يكن تم الثالث البشريةً. بعد رئيس قدما والقرى ٣٠, فصل أعمال الإثنان أي, الوراء ارتكبها أضف كل. عشوائية والفلبين فعل عل, الى بينما بالجانب بل.<br/><br/>حصدت معزّزة أي على, اليابان، الإقتصادي فصل و. بحث قدما بريطانيا، إذ, ثم فسقط القوى الإقتصادي يبق. ذات عن المنتصر التحالف الإنذار،, بل قام الأمم التّحول. وكسبت أدوات واُسدل عل دار, عل وأزيز يتعلّق الوراء جعل.<br/><br/>مع موالية التكاليف الاندونيسية بال. حيث إذ مقاطعة بمحاولة والفلبين. حاول وبدون الأوروبيّون إيو تم. الى أي ودول إبّان, وزارة ارتكبها العسكري كان مع, وقد المضي الساحلية أي. وتم فسقط واُسدل هو, أملاً أجزاء عن الا.<br/><br/>عرض ببعض مايو لم. لم بحق السيء وبولندا الربيع،, يكن تم الجديدة، الإكتفاء. فشكّل الآلاف المتساقطة، عل عرض, فعل واحدة ويتّفق الأوروبي و. كان أم بزمام ممثّلة, يكن ان الجنوب جديداً.<br/><br/>بحث وسفن والقرى مع, وقد ما غريمه أصقاع, أمّا الساحل الصينية عل وصل. يكن وتنصيب الدّفاع والمانيا بـ, حول اعتداء الإكتفاء الإيطالية ثم. زهاء إعادة ويعزى إذ الا, لإعادة الثقيل الإكتفاء به، لم, وحتى البشريةً تشيكوسلوفاكيا بـ فقد. من أسر أملاً المتاخمة, هُزم تسمّى يرتبط لم إيو.<br/><br/>ثم النفط القوى المتحدة أخذ, مايو معارضة عدم أي. بـ ولم تكبّد العناد شموليةً, قام عن سقوط العاصمة المتّبعة. ما أضف ديسمبر ويكيبيديا. إذ به، الآلاف بأضرار, بحق أحدث إستيلاء التاريخ، إذ. جُل بـ سبتمبر معارضة الحدود. أن فعل وانتهاءً الحيلولة.<br/><br/>قُدُماً اليابان، من ضرب, مئات أوروبا تم حدى. و الستار استدعى معارضة جعل, جمعت أمّا شيء و. كل بين أوزار الأمريكي, مرجع والكساد أم ذات, جيوب ميناء الأوروبية، ما بها. الهادي بالحرب و بين.<br/><br/>٣٠ وصافرات بالإنزال المشتّتون أخر, بسبب اتفاق التقليدية أسر أي. فقد و ثمّة أجزاء التحالف, زهاء اليابانية ما أسر. وصغار الإنذار، الدولارات بعض أي, أي شعار وحرمان الأوروبية ضرب, عجّل المدن لهيمنة مكن ما. عن الشطر واتّجه تكاليف هذه, حول أوسع التاريخ، مع. أم أخر فكان الربيع، وهولندا،.<br/><br/>بعد حقول كُلفة الأبرياء لم. جدول استطاعوا قبل في, هو لغزو قُدُماً بعض. كل وتنامت التقليدي عدد, حصدت الأجل الثقيلة على في. لان حصدت تسمّى السفن قد.<br/><br/>عن نفس يعادل بقيادة السيطرة. مدن تكبّد كانتا ما, أن ومحاولة باستحداث جهة, وإعلان تغييرات استراليا، تم تعد. ثم بالحرب الإنزال تزامناً مدن, ٣٠ ذلك العاصمة ابتدعها. لم يعبأ يرتبط واستمرت وقد. هذه و بوابة أساسي وباستثناء, قبضتهم ويتّفق قبل ان</p>`,
            'time'          : '28 نيسان',
            'read'          : false,
            'starred'       : false,
            'important'     : true,
            'labels'        : [
                1
            ],
            'folder'        : 0
        },
    
        {
            'id'            : '15459251a6d6b397565',
            'from'          : {
                'name'  : 'الادارة العامة',
                'avatar': 'assets/images/avatars/Henderson.jpg',
                'email' : ''
            },
            'to'            : [
                {
                    'name' : 'me',
                    'email': 'johndoe@creapond.com'
                }
            ],
            'subject'       : 'طلب حجز مقسم',
            'message'       : `<p>بـ جُل هناك وإعلان وفرنسا, يبق بـ الدمج التكاليف. السادس السيطرة غير أن. دار بـ أحدث يعادل أوروبا, الشهيرة الإمتعاض الأمريكية إذ حدى, يكن تم الثالث البشريةً. بعد رئيس قدما والقرى ٣٠, فصل أعمال الإثنان أي, الوراء ارتكبها أضف كل. عشوائية والفلبين فعل عل, الى بينما بالجانب بل.<br/><br/>حصدت معزّزة أي على, اليابان، الإقتصادي فصل و. بحث قدما بريطانيا، إذ, ثم فسقط القوى الإقتصادي يبق. ذات عن المنتصر التحالف الإنذار،, بل قام الأمم التّحول. وكسبت أدوات واُسدل عل دار, عل وأزيز يتعلّق الوراء جعل.<br/><br/>مع موالية التكاليف الاندونيسية بال. حيث إذ مقاطعة بمحاولة والفلبين. حاول وبدون الأوروبيّون إيو تم. الى أي ودول إبّان, وزارة ارتكبها العسكري كان مع, وقد المضي الساحلية أي. وتم فسقط واُسدل هو, أملاً أجزاء عن الا.<br/><br/>عرض ببعض مايو لم. لم بحق السيء وبولندا الربيع،, يكن تم الجديدة، الإكتفاء. فشكّل الآلاف المتساقطة، عل عرض, فعل واحدة ويتّفق الأوروبي و. كان أم بزمام ممثّلة, يكن ان الجنوب جديداً.<br/><br/>بحث وسفن والقرى مع, وقد ما غريمه أصقاع, أمّا الساحل الصينية عل وصل. يكن وتنصيب الدّفاع والمانيا بـ, حول اعتداء الإكتفاء الإيطالية ثم. زهاء إعادة ويعزى إذ الا, لإعادة الثقيل الإكتفاء به، لم, وحتى البشريةً تشيكوسلوفاكيا بـ فقد. من أسر أملاً المتاخمة, هُزم تسمّى يرتبط لم إيو.<br/><br/>ثم النفط القوى المتحدة أخذ, مايو معارضة عدم أي. بـ ولم تكبّد العناد شموليةً, قام عن سقوط العاصمة المتّبعة. ما أضف ديسمبر ويكيبيديا. إذ به، الآلاف بأضرار, بحق أحدث إستيلاء التاريخ، إذ. جُل بـ سبتمبر معارضة الحدود. أن فعل وانتهاءً الحيلولة.<br/><br/>قُدُماً اليابان، من ضرب, مئات أوروبا تم حدى. و الستار استدعى معارضة جعل, جمعت أمّا شيء و. كل بين أوزار الأمريكي, مرجع والكساد أم ذات, جيوب ميناء الأوروبية، ما بها. الهادي بالحرب و بين.<br/><br/>٣٠ وصافرات بالإنزال المشتّتون أخر, بسبب اتفاق التقليدية أسر أي. فقد و ثمّة أجزاء التحالف, زهاء اليابانية ما أسر. وصغار الإنذار، الدولارات بعض أي, أي شعار وحرمان الأوروبية ضرب, عجّل المدن لهيمنة مكن ما. عن الشطر واتّجه تكاليف هذه, حول أوسع التاريخ، مع. أم أخر فكان الربيع، وهولندا،.<br/><br/>بعد حقول كُلفة الأبرياء لم. جدول استطاعوا قبل في, هو لغزو قُدُماً بعض. كل وتنامت التقليدي عدد, حصدت الأجل الثقيلة على في. لان حصدت تسمّى السفن قد.<br/><br/>عن نفس يعادل بقيادة السيطرة. مدن تكبّد كانتا ما, أن ومحاولة باستحداث جهة, وإعلان تغييرات استراليا، تم تعد. ثم بالحرب الإنزال تزامناً مدن, ٣٠ ذلك العاصمة ابتدعها. لم يعبأ يرتبط واستمرت وقد. هذه و بوابة أساسي وباستثناء, قبضتهم ويتّفق قبل ان</p>`,
            'time'          : '28 شباط',
            'read'          : false,
            'starred'       : false,
            'important'     : true,
            'labels'        : [
                2
            ],
            'folder'        : 0
        },
    
        {
            'id'            : '15459251a6d6b397565',
            'from'          : {
                'name'  : 'مدير الشكاوى',
                'avatar': 'assets/images/avatars/Nancy.jpg',
                'email' : ''
            },
            'to'            : [
                {
                    'name' : 'me',
                    'email': 'johndoe@creapond.com'
                }
            ],
            'subject'       : 'خدمة سيئة',
            'message'       : `<p>بـ جُل هناك وإعلان وفرنسا, يبق بـ الدمج التكاليف. السادس السيطرة غير أن. دار بـ أحدث يعادل أوروبا, الشهيرة الإمتعاض الأمريكية إذ حدى, يكن تم الثالث البشريةً. بعد رئيس قدما والقرى ٣٠, فصل أعمال الإثنان أي, الوراء ارتكبها أضف كل. عشوائية والفلبين فعل عل, الى بينما بالجانب بل.<br/><br/>حصدت معزّزة أي على, اليابان، الإقتصادي فصل و. بحث قدما بريطانيا، إذ, ثم فسقط القوى الإقتصادي يبق. ذات عن المنتصر التحالف الإنذار،, بل قام الأمم التّحول. وكسبت أدوات واُسدل عل دار, عل وأزيز يتعلّق الوراء جعل.<br/><br/>مع موالية التكاليف الاندونيسية بال. حيث إذ مقاطعة بمحاولة والفلبين. حاول وبدون الأوروبيّون إيو تم. الى أي ودول إبّان, وزارة ارتكبها العسكري كان مع, وقد المضي الساحلية أي. وتم فسقط واُسدل هو, أملاً أجزاء عن الا.<br/><br/>عرض ببعض مايو لم. لم بحق السيء وبولندا الربيع،, يكن تم الجديدة، الإكتفاء. فشكّل الآلاف المتساقطة، عل عرض, فعل واحدة ويتّفق الأوروبي و. كان أم بزمام ممثّلة, يكن ان الجنوب جديداً.<br/><br/>بحث وسفن والقرى مع, وقد ما غريمه أصقاع, أمّا الساحل الصينية عل وصل. يكن وتنصيب الدّفاع والمانيا بـ, حول اعتداء الإكتفاء الإيطالية ثم. زهاء إعادة ويعزى إذ الا, لإعادة الثقيل الإكتفاء به، لم, وحتى البشريةً تشيكوسلوفاكيا بـ فقد. من أسر أملاً المتاخمة, هُزم تسمّى يرتبط لم إيو.<br/><br/>ثم النفط القوى المتحدة أخذ, مايو معارضة عدم أي. بـ ولم تكبّد العناد شموليةً, قام عن سقوط العاصمة المتّبعة. ما أضف ديسمبر ويكيبيديا. إذ به، الآلاف بأضرار, بحق أحدث إستيلاء التاريخ، إذ. جُل بـ سبتمبر معارضة الحدود. أن فعل وانتهاءً الحيلولة.<br/><br/>قُدُماً اليابان، من ضرب, مئات أوروبا تم حدى. و الستار استدعى معارضة جعل, جمعت أمّا شيء و. كل بين أوزار الأمريكي, مرجع والكساد أم ذات, جيوب ميناء الأوروبية، ما بها. الهادي بالحرب و بين.<br/><br/>٣٠ وصافرات بالإنزال المشتّتون أخر, بسبب اتفاق التقليدية أسر أي. فقد و ثمّة أجزاء التحالف, زهاء اليابانية ما أسر. وصغار الإنذار، الدولارات بعض أي, أي شعار وحرمان الأوروبية ضرب, عجّل المدن لهيمنة مكن ما. عن الشطر واتّجه تكاليف هذه, حول أوسع التاريخ، مع. أم أخر فكان الربيع، وهولندا،.<br/><br/>بعد حقول كُلفة الأبرياء لم. جدول استطاعوا قبل في, هو لغزو قُدُماً بعض. كل وتنامت التقليدي عدد, حصدت الأجل الثقيلة على في. لان حصدت تسمّى السفن قد.<br/><br/>عن نفس يعادل بقيادة السيطرة. مدن تكبّد كانتا ما, أن ومحاولة باستحداث جهة, وإعلان تغييرات استراليا، تم تعد. ثم بالحرب الإنزال تزامناً مدن, ٣٠ ذلك العاصمة ابتدعها. لم يعبأ يرتبط واستمرت وقد. هذه و بوابة أساسي وباستثناء, قبضتهم ويتّفق قبل ان</p>`,
            'time'          : '3 اذار',
            'read'          : false,
            'starred'       : false,
            'important'     : true,
            'labels'        : [
                0
            ],
            'folder'        : 0
        },
    
        {
            'id'            : '15459251a6d6b397565',
            'from'          : {
                'name'  : 'مدير الشكاوى',
                'avatar': 'assets/images/avatars/carl.jpg',
                'email' : ''
            },
            'to'            : [
                {
                    'name' : 'me',
                    'email': 'johndoe@creapond.com'
                }
            ],
            'subject'       : 'تأخر طلب تقديم العضوية',
            'message'       : `<p>بـ جُل هناك وإعلان وفرنسا, يبق بـ الدمج التكاليف. السادس السيطرة غير أن. دار بـ أحدث يعادل أوروبا, الشهيرة الإمتعاض الأمريكية إذ حدى, يكن تم الثالث البشريةً. بعد رئيس قدما والقرى ٣٠, فصل أعمال الإثنان أي, الوراء ارتكبها أضف كل. عشوائية والفلبين فعل عل, الى بينما بالجانب بل.<br/><br/>حصدت معزّزة أي على, اليابان، الإقتصادي فصل و. بحث قدما بريطانيا، إذ, ثم فسقط القوى الإقتصادي يبق. ذات عن المنتصر التحالف الإنذار،, بل قام الأمم التّحول. وكسبت أدوات واُسدل عل دار, عل وأزيز يتعلّق الوراء جعل.<br/><br/>مع موالية التكاليف الاندونيسية بال. حيث إذ مقاطعة بمحاولة والفلبين. حاول وبدون الأوروبيّون إيو تم. الى أي ودول إبّان, وزارة ارتكبها العسكري كان مع, وقد المضي الساحلية أي. وتم فسقط واُسدل هو, أملاً أجزاء عن الا.<br/><br/>عرض ببعض مايو لم. لم بحق السيء وبولندا الربيع،, يكن تم الجديدة، الإكتفاء. فشكّل الآلاف المتساقطة، عل عرض, فعل واحدة ويتّفق الأوروبي و. كان أم بزمام ممثّلة, يكن ان الجنوب جديداً.<br/><br/>بحث وسفن والقرى مع, وقد ما غريمه أصقاع, أمّا الساحل الصينية عل وصل. يكن وتنصيب الدّفاع والمانيا بـ, حول اعتداء الإكتفاء الإيطالية ثم. زهاء إعادة ويعزى إذ الا, لإعادة الثقيل الإكتفاء به، لم, وحتى البشريةً تشيكوسلوفاكيا بـ فقد. من أسر أملاً المتاخمة, هُزم تسمّى يرتبط لم إيو.<br/><br/>ثم النفط القوى المتحدة أخذ, مايو معارضة عدم أي. بـ ولم تكبّد العناد شموليةً, قام عن سقوط العاصمة المتّبعة. ما أضف ديسمبر ويكيبيديا. إذ به، الآلاف بأضرار, بحق أحدث إستيلاء التاريخ، إذ. جُل بـ سبتمبر معارضة الحدود. أن فعل وانتهاءً الحيلولة.<br/><br/>قُدُماً اليابان، من ضرب, مئات أوروبا تم حدى. و الستار استدعى معارضة جعل, جمعت أمّا شيء و. كل بين أوزار الأمريكي, مرجع والكساد أم ذات, جيوب ميناء الأوروبية، ما بها. الهادي بالحرب و بين.<br/><br/>٣٠ وصافرات بالإنزال المشتّتون أخر, بسبب اتفاق التقليدية أسر أي. فقد و ثمّة أجزاء التحالف, زهاء اليابانية ما أسر. وصغار الإنذار، الدولارات بعض أي, أي شعار وحرمان الأوروبية ضرب, عجّل المدن لهيمنة مكن ما. عن الشطر واتّجه تكاليف هذه, حول أوسع التاريخ، مع. أم أخر فكان الربيع، وهولندا،.<br/><br/>بعد حقول كُلفة الأبرياء لم. جدول استطاعوا قبل في, هو لغزو قُدُماً بعض. كل وتنامت التقليدي عدد, حصدت الأجل الثقيلة على في. لان حصدت تسمّى السفن قد.<br/><br/>عن نفس يعادل بقيادة السيطرة. مدن تكبّد كانتا ما, أن ومحاولة باستحداث جهة, وإعلان تغييرات استراليا، تم تعد. ثم بالحرب الإنزال تزامناً مدن, ٣٠ ذلك العاصمة ابتدعها. لم يعبأ يرتبط واستمرت وقد. هذه و بوابة أساسي وباستثناء, قبضتهم ويتّفق قبل ان</p>`,
            'time'          : '16 نيسان',
            'read'          : false,
            'starred'       : false,
            'important'     : true,
            'labels'        : [
                1
            ],
            'folder'        : 0
        },
    
        
    ];

    public static folders = [
        {
            'id'    : 0,
            'handle': 'inbox',
            'title' : 'Inbox',
            'icon'  : 'inbox'
        },
        {
            'id'    : 1,
            'handle': 'sent',
            'title' : 'Sent',
            'icon'  : 'send'
        },
        {
            'id'    : 2,
            'handle': 'drafts',
            'title' : 'Drafts',
            'icon'  : 'email_open'
        },
        {
            'id'    : 3,
            'handle': 'spam',
            'title' : 'Spam',
            'icon'  : 'error'
        },
        {
            'id'    : 4,
            'handle': 'trash',
            'title' : 'Trash',
            'icon'  : 'delete'
        }
    ];

    public static filters = [
        {
            'id'    : 0,
            'handle': 'starred',
            'title' : 'Starred',
            'icon'  : 'star'
        },
        {
            'id'    : 1,
            'handle': 'important',
            'title' : 'Important',
            'icon'  : 'label'
        }
    ];

    public static labels = [
        {
            'id'    : 0,
            'handle': 'accepted',
            'title' : 'مقبول',
            'color' : '#7cb342'
        },
        {
            'id'    : 1,
            'handle': 'declined',
            'title' : 'مرفوض',
            'color' : '#d84315'
        },
        {
            'id'    : 2,
            'handle': 'waiting',
            'title' : 'انتظار',
            'color' : '#607d8b'
        }
    ];
}
